## Import and Install

In [ ]:
!pip install pandas streamlit sqlalchemy psycopg2-binary python-dotenv -q

In [1]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine
import streamlit as st  
import os
from dotenv import load_dotenv

## .env Load

In [2]:
load_dotenv()
user = os.getenv("PGADMIN_USER")
password = os.getenv("PGADMIN_PASSWORD")

## PostgreSQL DB Connection

In [3]:
DATABASE_URL = f"postgresql://{user}:{password}@localhost:5432/food_waste_management"
engine = create_engine(DATABASE_URL)

In [4]:
def get_providers():
    query = "SELECT * FROM providers;"
    return pd.read_sql(query, engine)

def get_receivers():
    query = "SELECT * FROM receivers;"
    return pd.read_sql(query, engine)

def get_food_listings():
    query = "SELECT * FROM food_listings;"
    return pd.read_sql(query, engine)

def get_claims():
    query = "SELECT * FROM claims;"
    return pd.read_sql(query, engine)

In [5]:
# get_receivers().head()
# get_providers().head()
# get_food_listings().head()
# get_claims().head()

## Data Entry from CSV to SQL-DB

In [ ]:
providers_df = pd.read_csv("data/providers_data.csv")
providers_df.columns = providers_df.columns.str.lower()
providers_df.to_sql("providers", engine, if_exists="append", index=False)
receivers_df = pd.read_csv("data/receivers_data.csv")
receivers_df.columns = receivers_df.columns.str.lower()
receivers_df.to_sql("receivers", engine, if_exists="append", index=False)
food_df = pd.read_csv("data/food_listings_data.csv", parse_dates=["Expiry_Date"])
food_df.columns = food_df.columns.str.lower()
food_df.to_sql("food_listings", engine, if_exists="append", index=False)
claims_df = pd.read_csv("data/claims_data.csv", parse_dates=["Timestamp"])
claims_df.columns = claims_df.columns.str.lower()
claims_df.to_sql("claims", engine, if_exists="append", index=False)

## Given Mandatory SQL Queries (15)

In [10]:
# Food providers and receivers in each city
query = """
SELECT 
    COALESCE(p.city, r.city) AS city,
    COUNT(DISTINCT p.provider_id) AS provider_count,
    COUNT(DISTINCT r.receiver_id) AS receiver_count
FROM providers p
FULL OUTER JOIN receivers r
    ON p.city = r.city
GROUP BY COALESCE(p.city, r.city)
ORDER BY provider_count DESC NULLS LAST;
"""

pd.read_sql(query, engine)

                          city  provider_count  receiver_count
0                    New Carol               3               0
1     South Christopherborough               3               0
2             North Kevinhaven               2               0
3                 South Thomas               2               0
4                  Williamview               2               0
...                        ...             ...             ...
1873                 Susanfurt               0               1
1874                 New James               0               1
1875               Robertsport               0               1
1876                 Susanview               0               1
1877          New Jeffreyhaven               0               1

[1878 rows x 3 columns]

In [11]:
# Type of food provider contributes the most food
query = """
SELECT 
    provider_type, 
    SUM(quantity) AS total_quantity
FROM food_listings
GROUP BY provider_type
ORDER BY total_quantity DESC;
"""

pd.read_sql(query, engine)

      provider_type  total_quantity
0        Restaurant            6923
1       Supermarket            6696
2  Catering Service            6116
3     Grocery Store            6059

In [12]:
# Contact info of all food providers in a specific city
city = 'New Jessica'

query = f"""
SELECT name, type, contact, address
FROM providers
WHERE city = '{city}';
"""

pd.read_sql(query, engine)

,name,type,contact,address
0,Gonzales-Cochran,Supermarket,+1-600-220-0480,"74347 Christopher Extensions\nAndreamouth, OK ..."

In [13]:
# Receivers that claimed the most food
query = """
SELECT 
    r.name, 
    COUNT(c.claim_id) AS total_claims
FROM claims c
JOIN receivers r ON c.receiver_id = r.receiver_id
GROUP BY r.name
ORDER BY total_claims DESC
LIMIT 10;
"""

pd.read_sql(query, engine)

                name  total_claims
0       Matthew Webb             5
1       Scott Hunter             5
2  William Frederick             5
3     Anthony Garcia             5
4         Betty Reid             4
5         Alvin West             4
6    Kristine Martin             4
7    Jennifer Nelson             4
8    Donald Caldwell             4
9    Alexandra Owens             4

In [14]:
# Total quantity of food available from all providers
query = """
SELECT 
    SUM(quantity) AS total_available_food
FROM food_listings;
"""

pd.read_sql(query, engine)

   total_available_food
0                 25794

In [15]:
# City with the highest number of food listings
query = """
SELECT 
    location AS city,
    COUNT(*) AS total_listings
FROM food_listings
GROUP BY location
ORDER BY total_listings DESC
LIMIT 1;
"""
pd.read_sql(query, engine)

        city  total_listings
0  New Carol               6

In [16]:
# Most commonly available food type
query = """
SELECT 
    food_type,
    COUNT(*) AS food_count
FROM food_listings
GROUP BY food_type
ORDER BY food_count DESC;
"""
pd.read_sql(query, engine)

        food_type  food_count
0      Vegetarian         336
1           Vegan         334
2  Non-Vegetarian         330

In [17]:
# Food claims count per food item
query = """
SELECT 
    f.food_name,
    COUNT(c.claim_id) AS claim_count
FROM claims c
JOIN food_listings f ON c.food_id = f.food_id
GROUP BY f.food_name
ORDER BY claim_count DESC;
"""
pd.read_sql(query, engine)

    food_name  claim_count
0        Rice          122
1        Soup          114
2       Dairy          110
3        Fish          108
4       Salad          106
5     Chicken          102
6       Bread           94
7       Pasta           87
8  Vegetables           86
9      Fruits           71

In [18]:
# Provider with most completed claims
query = """
SELECT 
    p.name AS provider_name,
    COUNT(c.claim_id) AS completed_claims
FROM claims c
JOIN food_listings f ON c.food_id = f.food_id
JOIN providers p ON f.provider_id = p.provider_id
WHERE c.status = 'Completed'
GROUP BY p.name
ORDER BY completed_claims DESC
LIMIT 1;
"""
pd.read_sql(query, engine)

  provider_name  completed_claims
0   Barry Group                 5

In [19]:
# Claim status percentage
query = """
SELECT 
    status,
    COUNT(*) * 100.0 / SUM(COUNT(*)) OVER () AS percentage
FROM claims
GROUP BY status;
"""
pd.read_sql(query, engine)

      status  percentage
0  Completed        33.9
1  Cancelled        33.6
2    Pending        32.5

In [20]:
# Average quantity claimed by reciever
query = """
SELECT 
    r.name AS receiver_name,
    AVG(f.quantity) AS avg_quantity_claimed
FROM claims c
JOIN receivers r ON c.receiver_id = r.receiver_id
JOIN food_listings f ON c.food_id = f.food_id
GROUP BY r.name
ORDER BY avg_quantity_claimed DESC;
"""
pd.read_sql(query, engine)

          receiver_name  avg_quantity_claimed
0          Peggy Knight                  50.0
1    Christopher Wright                  50.0
2           Nancy Silva                  50.0
3            Lisa Pitts                  50.0
4       Daniel Williams                  50.0
..                  ...                   ...
615       John Reynolds                   2.0
616     Matthew Johnson                   2.0
617      Kenneth Barnes                   2.0
618        Amanda Kline                   1.0
619       Joshua Hooper                   1.0

[620 rows x 2 columns]

In [21]:
# Most claimed food type
query = """
SELECT 
    meal_type,
    COUNT(*) AS claim_count
FROM claims c
JOIN food_listings f ON c.food_id = f.food_id
GROUP BY meal_type
ORDER BY claim_count DESC;
"""
pd.read_sql(query, engine)

   meal_type  claim_count
0  Breakfast          278
1      Lunch          250
2     Snacks          240
3     Dinner          232

In [22]:
# Total quantity donated per provider
query = """
SELECT 
    p.name AS provider_name,
    SUM(f.quantity) AS total_quantity_donated
FROM food_listings f
JOIN providers p ON f.provider_id = p.provider_id
GROUP BY p.name
ORDER BY total_quantity_donated DESC;
"""
pd.read_sql(query, engine)

                       provider_name  total_quantity_donated
0                         Miller Inc                     217
1                        Barry Group                     179
2         Evans, Wright and Mitchell                     158
3                        Smith Group                     150
4                       Campbell LLC                     145
..                               ...                     ...
623                  Norris-Townsend                       1
624                        Mcgee PLC                       1
625                   Gonzales-Moore                       1
626                   Reyes and Sons                       1
627  Martinez, Armstrong and Carroll                       1

[628 rows x 2 columns]

In [23]:
# Food items expiring in the next 3 days
query = """
SELECT 
    food_name,
    expiry_date,
    location
FROM food_listings
WHERE expiry_date <= CURRENT_DATE + INTERVAL '3 days'
ORDER BY expiry_date;
"""
pd.read_sql(query, engine)

    food_name expiry_date            location
0       Salad  2025-03-16   Port Richardshire
1     Chicken  2025-03-16           Coleburgh
2        Rice  2025-03-16       Brittanyville
3       Salad  2025-03-16       Jonathanhaven
4       Salad  2025-03-16      Lake Karenfurt
..        ...         ...                 ...
995    Fruits  2025-03-30      East Elizabeth
996      Rice  2025-03-30  North Victoriastad
997      Fish  2025-03-30      North Garybury
998      Rice  2025-03-30           Derekport
999      Rice  2025-03-30           Sharonton

[1000 rows x 3 columns]

In [24]:
# Monthly trend of completed claims
query = """
SELECT 
    DATE_TRUNC('month', timestamp) AS month,
    COUNT(*) AS completed_claims
FROM claims
WHERE status = 'Completed'
GROUP BY month
ORDER BY month;
"""
pd.read_sql(query, engine)

       month  completed_claims
0 2025-03-01               339